// За допомогою циклу `for` виведи числа від 1 до 5. Кожне число має з’явитися в консолі на окремому рядку.
function count(start, end) {
    for (let i = start; i <= end; i++) {
        console.log(i);
    }
}

// count(1, 5);

//  Створи `removeSpaces(text)`. Циклом побудуй новий рядок, додаючи лише символи, які не є пробілами. Перевір `'learn js daily'`.
function removeSpaces(text) {
    let newText = "";
    for (let i = 0; i < text.length - 1; i++) {
        if (text[i] !== " ") {
            newText += text[i];
        }
    }
    return newText;
}

// console.log(removeSpaces("learn js daily"))

//Створи `reverseText(text)`, яка проходить від останнього символу до першого і повертає перевернутий рядок. Перевір `'browser'`.

function reverseText(text) {
    let revText = '';
    for (let i = text.length - 1; i >= 0; i--) {
        revText += text[i];
    }
    return revText;
}

// console.log(reverseText('browser'))

// Створи `hideVowels(text)`. Без `replace()` пройди циклом і заміни англійські голосні в будь-якому регістрі на `*`. Інші символи залиш без змін. Перевір `'Frontend'`.

function hideVowels(text) {
    let newText = '';
    const vowels = 'aoieu';
    for (let i = 0; i < text.length; i++) {
        const symbol = text[i];
        const symbolLower = symbol.toLowerCase();
        const isVowel = vowels.includes(symbolLower);
        newText = newText + isVowel ? "*" : symbol;
    }
    return newText;
}

// console.log(hideVowels('Frontend'));

//Створи `getInitials(fullName)`. Після `trim()` додай у результат першу літеру рядка та кожну літеру після пробілу.
// Ініціали мають бути великими й розділеними крапками. Перевір `'  olena kovalenko  '`.

function getInitials(fullName) {
    // return (fullName.trim()[0] + "." + fullName.trim().slice(fullName.trim().indexOf(" ") + 1, fullName.trim().indexOf(" ") + 2) + ".").toUpperCase()
    const str = fullName.trim();
    const index = str.indexOf(" ")
    const initials = str[0] + "." + str.slice(index + 1, index + 2) + ".";
    return initials.toUpperCase();
}

// console.log(getInitials('  olena kovalenko  '))

// Створи `findLongestWord(text)`. Не використовуй масиви або `split()`. Проходь по рядку разом із додатковим
// пробілом у кінці, накопичуй поточне слово й запам’ятовуй найдовше. Перевір `'learning loops builds skill'`.

function findLongestWord(text) {
    let longestWord = '';
    let currWord = '';
    for (let i = 0; i < text.length; i++) {
        currWord += text[i];
        if (text[i] === " " || i === text.length - 1) {
            if (currWord.length > longestWord.length) {
                longestWord = currWord;
            }
            currWord = "";
        }
    }
    return longestWord;
}

// console.log(findLongestWord('learning loops builds skill'))

// ------------------------------------------------------------ ADDITIONAL ------------------------------------------------------------

/*Створи функцію calculate(a, b, operator).
  Параметр operator може містити:
  - "+";
  - "-";
  - "*";
  - "/".

  Функція повинна виконувати відповідну операцію через switch.
  Особливі випадки:
  - якщо під час ділення b дорівнює 0, поверни "Cannot divide by zero";
  - якщо передано невідомий оператор, поверни "Unknown operator".
  */
function calculate(a, b, operator) {

    switch (operator) {
        case '+':
            return a + b;
        case '-':
            return a - b;
        case '*':
            return a * b;
        case '/':
            return b === 0 ? "Cannot divide by zero" : a / b;
        default:
            return "Unknown operator";
    }
}

// console.log(calculate(10, 5, '+')); // 15
// console.log(calculate(10, 5, '-')); // 5
// console.log(calculate(10, 5, '*')); // 50
// console.log(calculate(10, 5, '/')); // 2
// console.log(calculate(10, 0, '/')); // "Cannot divide by zero"
// console.log(calculate(10, 5, '%')); // "Unknown operator"

// ------------------------------------------------------------ Завдання 2: ------------------------------------------------------------

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

function isTen(number) {
    return Number(number) === 10 ? "Вірно" : "Невірно";
}

// console.log(isTen(1));
// ------------------------------------------------------------ Завдання 2: ------------------------------------------------------------

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"
// const min = Math.floor(Math.random() * 59);

function quart() {
    const min = Math.floor(Math.random() * 59);
    console.log(min)
    switch (true) {
        case min < 15:
            return "у першу";
        case min < 30:
            return "у другу";
        case min < 45:
            return "у третю";
        default:
            return "у четверту";
    }
}

// console.log(quart());
// 25 < 30 обчислюється в true (boolean); Порівняння: 25 === true
// ------------------------------------------------------------ Завдання 3: ------------------------------------------------------------

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

function season(num) {
    switch (num) {
        case 1 :
            return "зима";
        case 2:
            return "весна";
        case 3:
            return "літо";
        case 4:
            return "осінь";
        default:
            return "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
    }
}

// console.log(season(5))
// ------------------------------------------------------------ Завдання 4: ------------------------------------------------------------

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// ------------------------------------------------------------ Завдання 5: ------------------------------------------------------------

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// ------------------------------------------------------------ Завдання 6: ------------------------------------------------------------

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// ------------------------------------------------------------ Завдання 7: ------------------------------------------------------------

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// ------------------------------------------------------------ Завдання 8: ------------------------------------------------------------

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// ------------------------------------------------------------ Завдання 9: ------------------------------------------------------------

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// ------------------------------------------------------------ Завдання 10: ------------------------------------------------------------

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

function fizzBuzz(num) {
    let result = "";
    for (let i = 1; i <= num; i++) {
        if (i % 3 === 0) {
            result +=  `for ${i} the result is: fizz \n`;
        } else if (i % 5 === 0) {
            result +=  `for ${i} the result is: buzz \n`;
        } else if (i % 3 === 0 && i % 5 === 0) {
            result +=  `for ${i} the result is: fifizzbuzzzz \n`;
        } else {
            result += `the ${i} isn't defined \n`;
        }
    }
    return result;
}
// console.log(fizzBuzz(23))